Patient: Hi, I guess I should start by saying I’m not really sure why I’m here. I’ve been feeling a lot of things since I returned from my service, and my friend suggested I talk to someone.

Therapist: Hi, it’s good to have you here. Can you tell me what’s been going on?

Patient: Yeah, sure. I’ve been having these nightmares, and I keep seeing things that remind me of my time in Afghanistan. It’s like I can’t escape it.

Therapist: It sounds like you might be experiencing some symptoms of PTSD. Have you ever heard of that before?

Patient: Yeah, I’ve heard of it. But I don’t think it’s that bad.

Therapist: Well, it’s important to take these symptoms seriously. PTSD can be a serious condition and it’s important to get help if you’re experiencing any of these symptoms.

Patient: I just feel like I should be able to handle it. I was in the army for three years, I should be able to handle a few bad dreams.

Therapist: It’s understandable that you would feel that way, but PTSD is not something you can just tough out. It’s a real condition that can have serious consequences if left untreated. That’s why it’s important to talk to someone about what’s been going on.

Patient: Okay, I guess that makes sense.

Therapist: So, can you tell me more about what you’ve been experiencing?

Patient: Well, like I said, I’ve been having these nightmares. And I keep seeing things that remind me of Afghanistan. Sometimes it’s just a sound or a smell, and it’s like I’m right back there again.

Therapist: That sounds really difficult. It’s understandable that you would be feeling overwhelmed. How have you been coping with these symptoms?

Patient: I’ve been trying to keep busy, but it’s like I can’t escape it. I’ve been drinking more than I used to, just to try and forget about it.

Therapist: Drinking might help you forget for a little while, but it’s not a healthy way to cope. It’s important to find other ways to deal with your symptoms.

Patient: I know, but it’s just so hard sometimes.

Therapist: It’s okay to feel that way. PTSD can be a very difficult condition to deal with. But there are ways to help you manage your symptoms. Have you ever heard of psychodynamic therapy?

Patient: No, I haven’t.

Therapist: It’s a type of therapy that focuses on your unconscious thoughts and feelings. It can help you understand why you’re feeling the way you are and help you to develop new ways of coping.

Patient: That sounds interesting. How does it work?

Therapist: Well, we’ll start by talking about your experiences in Afghanistan and any other experiences that might be contributing to your symptoms. We’ll explore the unconscious thoughts and feelings that might be driving your behavior and help you to develop new ways of coping.

Patient: That sounds like it could be helpful.

Therapist: It can be very helpful for people with PTSD. But it’s important to remember that it’s a process. It’s not something that will happen overnight.

Patient: I understand. I just want to feel better.

Therapist: I understand that. And we’ll work together to help you feel better. It might take some time, but we’ll get there.

Patient: Alright. I’m willing to try.

Therapist: That’s great to hear. Remember, there’s no shame in asking for help. It takes courage to seek help when you need it.

Patient: Thank you for saying that. I’ve been feeling pretty alone lately.

Therapist: You’re not alone. We’re here to support you. And we’ll work together to help you manage your symptoms and feel better.
